Revit 2027 API
AreaBasedLoadData.CanDisconnectFromUpstreamNode Method
 Verifies that the area based load can disconnect from the upstream electrical analytical node. If the area based load hasn't an upstream node, it can't disconnect from the upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanDisconnectFromUpstreamNode()
Public Function CanDisconnectFromUpstreamNode As Boolean
public:
bool CanDisconnectFromUpstreamNode()
member CanDisconnectFromUpstreamNode : unit -> bool
Return Value
Boolean
 True if the area based load can disconnect from the upstream electrical analytical node.
Remarks
 If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace